DataProcessors/ДокументооборотСКонтролирующимиОрганами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<DataProcessor>
		<Properties>
			<Name>ДокументооборотСКонтролирующимиОрганами</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Enums/ПриказОписиИсходящихДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ПриказОписиИсходящихДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПриказММВ_7_6_16</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриказММВ_7_6_465</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыПредставляемыхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыПредставляемыхДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СчетФактура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КнигаПокупок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КнигаПродаж</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЖурналПолученныхИВыставленныхСчетовФактур</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварноТранспортнаяНакладная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктПриемкиСдачиРабот</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГрузоваяТаможеннаяДекларация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДобавочныйЛистГрузовойТаможеннойДекларации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныйЛистКнигиПокупок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныйЛистКнигиПродаж</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварнаяНакладнаяТОРГ12</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СпецификацияЦены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнениеКДоговору</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Договор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировочныйСчетФактура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетНИОКР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаТоваров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УПД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИныеДокументы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктОРасхождениях</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктНаПередачуПрав</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументОбИзмененииСтоимости</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/СканированныеДокументыДляПередачиВЭлектронномВиде.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>СканированныеДокументыДляПередачиВЭлектронномВиде</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПредставляемыхДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВсего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОснования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОснования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НаправленияДокументаПоТребованиюФНС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИсточникДокументаПоТребованиюФНСБРО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСтрокиИсточника</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияПриказа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПриказОписиИсходящихДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СведенияДокументаОснования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СведенияДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КВД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РеквизитыУчастников</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КонтрагентБРО</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьРольУчастника</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Роль</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РолиУчастниковСделкиДокументаПоТребованиюФНС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЮрЛицоНаименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЮрЛицоИНН</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЮрЛицоКПП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизЛицоФамилия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>60</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизЛицоИмя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>60</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизЛицоОтчество</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>60</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизЛицоИНН</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>12</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЯвляетсяЮрЛицом</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ДокументооборотСКонтролирующимиОрганами/Forms/ОшибкаОтправкиПисьмаВФНС/Ext/Form/Module.bsl
&НаКлиенте
Перем КонтекстЭДОКлиент Экспорт;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Письмо = Параметры.Письмо;
	
	Подстроки = Новый Массив;
	Подстроки.Добавить(Параметры.ОписаниеОшибки);
	Подстроки.Добавить(Символы.ПС);
	Подстроки.Добавить(Символы.ПС);
	Подстроки.Добавить(НСтр("ru = 'Для отправки больших писем и ответов на требование используйте Пакет с дополнительными документами.'"));
	
	Подстроки = Новый ФорматированнаяСтрока(Подстроки);
	
	Элементы.ОписаниеОшибки.Заголовок = Подстроки;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	КонтекстЭДО = Неопределено;
	
	ВыполняемоеОповещение = Новый ОписаниеОповещения("ПослеПолученияКонтекстаЭДО", ЭтотОбъект);
	ДокументооборотСКОКлиент.ПолучитьКонтекстЭДО(ВыполняемоеОповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПолученияКонтекстаЭДО(ВхКонтекст, ДопПараметры) Экспорт
	
	Если ВхКонтекст.КонтекстЭДО <> Неопределено Тогда 
		КонтекстЭДОКлиент = ВхКонтекст.КонтекстЭДО;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПакет(Команда)
	
	ОписанияФайлов = РезультатПроверкиФайлов();
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ОткрытьОписьПослеВопроса", 
		ЭтотОбъект);
		
	Если ЕстьОшибки Тогда
	
		ДополнительныеПараметры = Новый Структура();
		ДополнительныеПараметры.Вставить("ОписанияФайлов", ОписанияФайлов);
		
		ОткрытьФорму(
			КонтекстЭДОКлиент.ПутьКОбъекту + ".Форма.ОшибкиПереносаФайлов", 
			ДополнительныеПараметры,
			,
			,
			,
			,
			ОписаниеОповещения,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
	Иначе
			
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, Истина);
		
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОткрытьОписьПослеВопроса(Результат, ВходящийКонтекст) Экспорт
	
	Если Результат <> Истина Тогда
		Возврат;
	КонецЕсли;
	
	Опись = ПакетСДопДокуменами();
	
	ПоказатьЗначение(, Опись);

КонецПроцедуры

&НаСервере
Функция ПакетСДопДокуменами()

	Если ЕстьФайлыДляПереноса Тогда
		Сканы       = СкопироватьФайлыИзПисьмаВСканы();
		ОписьОбъект = СоздатьОпись(Сканы);
	Иначе
		ОписьОбъект = СоздатьОпись();
	КонецЕсли;
	
	Возврат ОписьОбъект;

КонецФункции

&НаСервере
Функция СоздатьСкан()

	СканОбъект = Справочники.СканированныеДокументыДляПередачиВЭлектронномВиде.СоздатьЭлемент();
	СканОбъект.Организация       = Письмо.Отправитель;
	СканОбъект.ВерсияПриказа     = Перечисления.ПриказОписиИсходящихДокументов.ПриказММВ_7_6_16;
	СканОбъект.ВидДокумента      = Перечисления.ВидыПредставляемыхДокументов.ИныеДокументы;
	СканОбъект.СведенияДокумента = Письмо.Наименование;
	СканОбъект.КВД               = "9999";
	СканОбъект.Записать();
	
	Возврат СканОбъект.Ссылка;

КонецФункции

&НаСервере
Функция СкопироватьФайлыИзПисьмаВСканы()

	КонтекстЭДОСервер = ДокументооборотСКО.ПолучитьОбработкуЭДО();
	НаборВложений = КонтекстЭДОСервер.ПолучитьВложенияНеформализованногоДокумента(Письмо,,Истина);
	
	МаксимальныйРазмер = 72 * 1024 * 1024; // 72 Мб
	
	Сканы  = Новый Массив;
	Размер = 0;
	Скан   = Неопределено;
	Номер  = 0;
	
	Для Каждого ЗаписьВложение Из НаборВложений Цикл 
		
		Если НЕ ФайлСоответствуетТребованиям(ЗаписьВложение.ИмяФайла) Тогда
			Продолжить;
		КонецЕсли;
		
		ДвДанные    = ЗаписьВложение.Данные.Получить();
		РазмерФайла = ДвДанные.Размер();
		Если Размер + РазмерФайла > МаксимальныйРазмер ИЛИ Размер = 0 Тогда
			
			// Сохраняем предыдущий
			Если Скан <> Неопределено Тогда
				Сканы.Добавить(Скан);
				Размер = 0;
				Номер  = 0;
			КонецЕсли;
			
			// Создаем новый
			Скан = СоздатьСкан();
		КонецЕсли;
		
		Размер = Размер + РазмерФайла;
		Номер  = Номер  + 1;
		
		ДополнительныеПараметры = Новый Структура();
		ДополнительныеПараметры.Вставить("ВладелецФайлов", 		Скан);
		ДополнительныеПараметры.Вставить("ИмяБезРасширения", 	ЗаписьВложение.ИмяФайла);
		ДополнительныеПараметры.Вставить("Автор", 				Неопределено);
		ДополнительныеПараметры.Вставить("РасширениеБезТочки", 	Неопределено);
		ДополнительныеПараметры.Вставить("ВремяИзмененияУниверсальное", Неопределено);
		
		Адрес  = ПоместитьВоВременноеХранилище(ДвДанные, Новый УникальныйИдентификатор); 
		
		//это новый файл, добавим его в базу
		ПрисоединенныйФайлСсылка = РаботаСФайлами.ДобавитьФайл(
			ДополнительныеПараметры,
			Адрес);
			
		ПрисоединенныйФайлОбъект = ПрисоединенныйФайлСсылка.ПолучитьОбъект();
		ПрисоединенныйФайлОбъект.НомерСтраницы = Номер;
		ПрисоединенныйФайлОбъект.Записать();
		
	КонецЦикла;
	
	Если Сканы.Найти(Скан) = Неопределено Тогда
		Сканы.Добавить(Скан);
	КонецЕсли;
	
	Возврат Сканы;
	
КонецФункции

&НаСервере
Функция РезультатПроверкиФайлов()

	КонтекстЭДОСервер = ДокументооборотСКО.ПолучитьОбработкуЭДО();
	НаборВложений = КонтекстЭДОСервер.ПолучитьВложенияНеформализованногоДокумента(Письмо,,Истина);
	
	ОписанияФайлов = Новый Массив;
	
	ЕстьФайлыДляПереноса = Ложь;
	ЕстьОшибки = Ложь;
	
	Для Каждого ЗаписьВложение Из НаборВложений Цикл 
		
		Данные = ЗаписьВложение.Данные.Получить();
		Адрес  = ПоместитьВоВременноеХранилище(Данные, Новый УникальныйИдентификатор);
		
		Выполнено = ФайлСоответствуетТребованиям(ЗаписьВложение.ИмяФайла);
		
		ДополнительныеПараметры = Новый Структура();
		ДополнительныеПараметры.Вставить("Имя", 	  ЗаписьВложение.ИмяФайла);
		ДополнительныеПараметры.Вставить("Адрес", 	  Адрес);
		ДополнительныеПараметры.Вставить("Размер", 	  Данные.Размер());
		ДополнительныеПараметры.Вставить("Выполнено", Выполнено);
		
		ОписанияФайлов.Добавить(ДополнительныеПараметры);
		
		Если Выполнено Тогда
			ЕстьФайлыДляПереноса = Истина;
		Иначе
			ЕстьОшибки = Истина;
		КонецЕсли;

	КонецЦикла;
		
	Возврат ОписанияФайлов;
	
КонецФункции

&НаСервере
Функция ФайлСоответствуетТребованиям(ИмяФайла)
	
	ДопустимыеТипыФайлов    = ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиентСервер.ДопустимыеТипыФайловТребования();
	ДопустимыеРасширения    = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(ВРЕГ(ДопустимыеТипыФайлов),";");

	СвойстваФайла = ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(ИмяФайла);
	Расширение    = СтрЗаменить(СвойстваФайла.Расширение, ".", "");
	ЕстьОшибка    = ОперацииСФайламиЭДКО.НужноПреобразоватьФормат(ДопустимыеРасширения, Расширение);
		
	Возврат НЕ ЕстьОшибка;
	
КонецФункции

&НаСервере
Функция СоздатьОпись(Сканы = Неопределено)

	ОписьОбъект = Справочники.ОписиИсходящихДокументовВНалоговыеОрганы.СоздатьЭлемент();
	ОписьОбъект.Организация = Письмо.Отправитель;
	
	Если Сканы <> Неопределено Тогда
		Для каждого Скан Из Сканы Цикл
			НоваяСтрока = ОписьОбъект.ПредставляемыеДокументы.Добавить();
			НоваяСтрока.ВидДокумента    = Перечисления.ВидыПредставляемыхДокументов.ИныеДокументы;
			НоваяСтрока.СсылкаНаОбъект  = Скан;
			НоваяСтрока.ПорядковыйНомер = 1;
		КонецЦикла; 
	КонецЕсли;
	
	ОписьОбъект.Записать();
	
	Возврат ОписьОбъект.Ссылка;

КонецФункции


#КонецОбласти
